#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_DEV.module.moh_applications.module.MOH_SPLUNK_COPY.keycloak_generic_client_protocol_mapper.role_list will be created
  + resource "keycloak_generic_client_protocol_mapper" "role_list" {
      + client_id       = (known after apply)
      + config          = {
          + "attribute.name"       = "role"
          + "attribute.nameformat" = "Basic"
          + "attribute.value"      = "value"
          + "friendly.name"        = "role"
        }
      + id              = (known after apply)
      + name            = "role list"
      + protocol        = "saml"
      + protocol_mapper = "Role List"
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MOH_SPLUNK_COPY.keycloak_generic_client_role_mapper.splunk_role_mapper will be created
  + resource "keycloak_generic_client_role_mapper" "splunk_role_mapper" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MOH_SPLUNK_COPY.keycloak_role.reportingadmin_role will be created
  + resource "keycloak_role" "reportingadmin_role" {
      + client_id   = (known after apply)
      + description = "This is the role that maps to hlth_rw in the HIVE"
      + id          = (known after apply)
      + name        = "reportingadmin"
      + realm_id    = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MOH_SPLUNK_COPY.keycloak_saml_client.CLIENT will be created
  + resource "keycloak_saml_client" "CLIENT" {
      + assertion_consumer_redirect_url     = "https://siem.secops.gov.bc.ca/health/saml/acs"
      + base_url                            = "https://siem.secops.gov.bc.ca/"
      + canonicalization_method             = "EXCLUSIVE"
      + client_id                           = "MOH_SPLUNK_COPY"
      + client_signature_required           = false
      + description                         = "This is a client to integrate with the OCIO's Splunk instance running against the HIVE. The HIVE is a centralized SIEM where we collect security related data to monitor and audit events occuring on MoH systems"
      + enabled                             = true
      + encrypt_assertions                  = false
      + encryption_certificate              = (known after apply)
      + encryption_certificate_sha1         = (known after apply)
      + force_name_id_format                = false
      + force_post_binding                  = true
      + front_channel_logout                = true
      + full_scope_allowed                  = false
      + id                                  = (known after apply)
      + idp_initiated_sso_url_name          = "MOH_SPLUNK_COPY"
      + include_authn_statement             = true
      + logout_service_redirect_binding_url = "https://siem.secops.gov.bc.ca/health/saml/logout"
      + name                                = "MOH_SPLUNK_COPY"
      + name_id_format                      = "username"
      + realm_id                            = "moh_applications"
      + sign_assertions                     = true
      + sign_documents                      = true
      + signature_algorithm                 = "RSA_SHA256"
      + signature_key_name                  = "KEY_ID"
      + signing_certificate                 = (known after apply)
      + signing_certificate_sha1            = (known after apply)
      + signing_private_key                 = (known after apply)
      + signing_private_key_sha1            = (known after apply)
      + valid_redirect_uris                 = [
          + "https://siem.secops.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MOH_SPLUNK_COPY.keycloak_saml_user_attribute_protocol_mapper.bceid_business_id will be created
  + resource "keycloak_saml_user_attribute_protocol_mapper" "bceid_business_id" {
      + client_id                  = (known after apply)
      + friendly_name              = "bceid_business_id"
      + id                         = (known after apply)
      + name                       = "bceid_business_id"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "bceid_business_id"
      + saml_attribute_name_format = "Basic"
      + user_attribute             = "bceid_business_id"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MOH_SPLUNK_COPY.keycloak_saml_user_attribute_protocol_mapper.idir_company will be created
  + resource "keycloak_saml_user_attribute_protocol_mapper" "idir_company" {
      + client_id                  = (known after apply)
      + friendly_name              = "idir_company"
      + id                         = (known after apply)
      + name                       = "idir_company"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "idir_company"
      + saml_attribute_name_format = "Basic"
      + user_attribute             = "idir_company"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @nathanielcx, Action: `pull_request`*